Fabien-Chouteau/Wee-Noise-Maker/hardware/discovery/STM32CubeMX.ioc
#MicroXplorer Configuration settings - do not modify
#Tue Dec 27 19:04:30 CET 2016
File.Version=4
I2S3.ErrorAudioFreq-Full_Duplex_Master=-2.34 %
I2S3.FullDuplexMode-Full_Duplex_Master=I2S_FULLDUPLEXMODE_ENABLE
I2S3.IPParameters=MCLKOutput-Master_Clock_Activated,ErrorAudioFreq-Full_Duplex_Master,RealAudioFreq-Full_Duplex_Master,Instance-Full_Duplex_Master,VirtualMode-Full_Duplex_Master,FullDuplexMode-Full_Duplex_Master
I2S3.Instance-Full_Duplex_Master=SPI$Index
I2S3.MCLKOutput-Master_Clock_Activated=I2S_MCLKOUTPUT_ENABLE
I2S3.RealAudioFreq-Full_Duplex_Master=187.5 KHz
I2S3.VirtualMode-Full_Duplex_Master=I2S_MODE_MASTER
KeepUserPlacement=false
Mcu.Family=STM32F4
Mcu.IP0=I2C3
Mcu.IP1=I2S3
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP4=USB_OTG_FS
Mcu.IPNb=5
Mcu.Name=STM32F417V(E-G)Tx
Mcu.Package=LQFP100
Mcu.Pin0=PH0-OSC_IN
Mcu.Pin1=PH1-OSC_OUT
Mcu.Pin10=PC10
Mcu.Pin11=PC11
Mcu.Pin12=PC12
Mcu.Pin2=PC7
Mcu.Pin3=PC9
Mcu.Pin4=PA8
Mcu.Pin5=PA9
Mcu.Pin6=PA10
Mcu.Pin7=PA11
Mcu.Pin8=PA12
Mcu.Pin9=PA15
Mcu.PinsNb=13
Mcu.UserName=STM32F417VGTx
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SysTick_IRQn=true\:0\:0
PA10.Locked=true
PA10.Mode=OTG/Dual_Role_Device
PA10.Signal=USB_OTG_FS_ID
PA11.Mode=OTG/Dual_Role_Device
PA11.Signal=USB_OTG_FS_DM
PA12.Mode=OTG/Dual_Role_Device
PA12.Signal=USB_OTG_FS_DP
PA15.Locked=true
PA15.Mode=Full_Duplex_Master
PA15.Signal=I2S3_WS
PA8.Mode=I2C
PA8.Signal=I2C3_SCL
PA9.Locked=true
PA9.Mode=Activate_VBUS
PA9.Signal=USB_OTG_FS_VBUS
PC10.Mode=Full_Duplex_Master
PC10.Signal=I2S3_CK
PC11.Mode=Full_Duplex_Master
PC11.Signal=I2S3_ext_SD
PC12.Mode=Full_Duplex_Master
PC12.Signal=I2S3_SD
PC7.Mode=Master_Clock_Activated
PC7.Signal=I2S3_MCK
PC9.Mode=I2C
PC9.Signal=I2C3_SDA
PCC.Family=STM32F4
PCC.MCU=STM32F417V(E-G)Tx
PCC.MXVersion=4.4.0
PCC.PartNumber=STM32F417VGTx
PCC.Seq0=0
PCC.SubFamily=STM32F407/417
PCC.Temperature=25
PCC.Vdd=3.3
PH0-OSC_IN.Mode=HSE-External-Oscillator
PH0-OSC_IN.Signal=RCC_OSC_IN
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PH1-OSC_OUT.Signal=RCC_OSC_OUT
RCC.48MHZClocksFreq_Value=48000000
RCC.AHBFreq_Value=16000000
RCC.APB1Freq_Value=16000000
RCC.APB2Freq_Value=16000000
RCC.EnableExtClockForI2S-ClockTree=false
RCC.EnableHSE-ClockTree=true
RCC.EnableHSERTCDevisor-ClockTree=false
RCC.EnableLSE-ClockTree=false
RCC.EnableLSERTC-ClockTree=false
RCC.ExtClockEnable-ClockTree=false
RCC.FLatency-AdvancedSettings=FLASH_LATENCY_0
RCC.FamilyName=M
RCC.HSEState-ClockTree=RCC_HSE_ON
RCC.HSE_VALUE=25000000
RCC.HSIState-ClockTree=RCC_HSI_ON
RCC.HSI_VALUE=16000000
RCC.I2SClocksFreq_Value=96000000
RCC.I2SEnable-ClockTree=true
RCC.IPParameters=EnableHSERTCDevisor-ClockTree,RTCFreq_Value,LSI_VALUE,FamilyName,OscillatorTypeHSI-ClockTree,FLatency-AdvancedSettings,APB2Freq_Value,OscillatorTypeHSE-ClockTree,USBFSEnable-ClockTree,I2SEnable-ClockTree,USBHSEnable-ClockTree,PLLSourceVirtualString,OscillatorTypeLSI-ClockTree,AHBFreq_Value,48MHZClocksFreq_Value,EnableLSE-ClockTree,VCOInputFreq_Value,I2SClocksFreq_Value,VCOOutputFreq_Value,SYSCLKFreq_VALUE,EnableHSE-ClockTree,VcooutputI2S,EnableExtClockForI2S-ClockTree,HSIState-ClockTree,LSE_VALUE,APB1Freq_Value,RCC_PERIPHCLK_I2SVar-ClockTree,HSE_VALUE,PWR_Regulator_Voltage_Scale-AdvancedSettings,MCO1OutPutEnable-ClockTree,HSI_VALUE,SDIOEnable-ClockTree,LSIState-ClockTree,EnableLSERTC-ClockTree,IWDGEnable-ClockTree,VCOI2SOutputFreq_Value,PLLState-ClockTree,RNGEnable-ClockTree,RTCHSEDivFreq_Value,MCO2OutPutEnable-ClockTree,PLLCLKFreq_Value,HSEState-ClockTree,ExtClockEnable-ClockTree,RTCEnable-ClockTree
RCC.IWDGEnable-ClockTree=false
RCC.LSE_VALUE=32768
RCC.LSIState-ClockTree=RCC_LSI_OFF
RCC.LSI_VALUE=32000
RCC.MCO1OutPutEnable-ClockTree=false
RCC.MCO2OutPutEnable-ClockTree=false
RCC.OscillatorTypeHSE-ClockTree=
RCC.OscillatorTypeHSI-ClockTree=RCC_OSCILLATORTYPE_HSI
RCC.OscillatorTypeLSI-ClockTree=
RCC.PLLCLKFreq_Value=96000000
RCC.PLLSourceVirtualString=RCC_PLLSOURCE_HSI
RCC.PLLState-ClockTree=RCC_PLL_ON
RCC.PWR_Regulator_Voltage_Scale-AdvancedSettings=PWR_REGULATOR_VOLTAGE_SCALE2
RCC.RCC_PERIPHCLK_I2SVar-ClockTree=RCC_PERIPHCLK_I2S
RCC.RNGEnable-ClockTree=false
RCC.RTCEnable-ClockTree=false
RCC.RTCFreq_Value=32000
RCC.RTCHSEDivFreq_Value=12500000
RCC.SDIOEnable-ClockTree=false
RCC.SYSCLKFreq_VALUE=16000000
RCC.USBFSEnable-ClockTree=true
RCC.USBHSEnable-ClockTree=false
RCC.VCOI2SOutputFreq_Value=192000000
RCC.VCOInputFreq_Value=1000000
RCC.VCOOutputFreq_Value=192000000
RCC.VcooutputI2S=96000000
USB_OTG_FS.IPParameters=use_external_vbus
USB_OTG_FS.use_external_vbus=ENABLE
